<?php

return [
    'image' => [
        'required' => 'حقل الصورة مطلوب.',
        'file' => 'يجب أن يكون الملف من نوع ملف.',
        'mimes' => 'يجب أن يكون الملف من الأنواع: jpeg, png, jpg, gif, svg.',
        'max' => 'لا يمكن أن يتجاوز حجم الصورة 2048 كيلوبايت.',
    ],
    'sender_id.required' => 'حقل الاسم مطلوب.',
    'sender_id.exists' => ' رقم معرف غير موجود',
    'receiver_id.required' => 'حقل الاسم مطلوب.',
    'receiver_id.exists' => ' رقم معرف غير موجود',
    'id.exists' => 'الفئة المحددة ليست فئة أساسية صالحة.',
    'id.required' => 'حقل المعرف  مطلوب.',
    'id.integer' => 'يجب ان يكون المعرف رقما ',
    'ERROR_OCCURRED' => 'حدث خطأ ' ,
    'id_not_found' => 'حدث خطأ:عنصر  غير موجود  ' ,
    'friend_request_exists' =>'تم ارسال طلب الصداقة ' ,

    'invalid_credentials' => 'كلمة المرور او الايميل غير صالحين ' ,


    'title.required' => 'حقل الاسم مطلوب.',
    'title.string' => 'يجب أن يكون الاسم نصًا.',
    'title.max' => 'لا يمكن أن يتجاوز طول الاسم 255 حرفًا.',

    'description.required' => 'حقل الاسم مطلوب.',
    'description.string' => 'يجب أن يكون الاسم نصًا.',

    'full_name.required' => 'حقل الاسم الكامل مطلوب.',
    'full_name.string' => 'يجب أن يكون الاسم الكامل نصًا.',
    'full_name.max' => 'لا يمكن أن يتجاوز طول الاسم الكامل 255 حرفًا.',

    'email.required' => 'حقل البريد الإلكتروني مطلوب.',
    'email.string' => 'يجب أن يكون البريد الإلكتروني نصًا.',
    'email.email' => 'يجب أن يكون البريد الإلكتروني عنوان بريد إلكتروني صالح.',
    'email.max' => 'لا يمكن أن يتجاوز طول البريد الإلكتروني 255 حرفًا.',
    'email.unique' => 'البريد الإلكتروني مستخدم بالفعل.',

    'phone.required' => 'حقل رقم الهاتف مطلوب.',
    'phone.string' => 'يجب أن يكون رقم الهاتف نصًا.',
    'phone.unique' => 'رقم الهاتف مستخدم بالفعل.',
    'phone.prefix' => 'يجب أن يحتوي رقم الجوال على مقدمة الدولة :prefix ويتكون من 9 إلى 14 رقماً.',
    'password' => [
        'required' => 'حقل كلمة المرور مطلوب.',
        'string' => 'يجب أن تكون كلمة المرور عبارة عن سلسلة.',
        'min' => 'يجب أن تكون كلمة المرور على الأقل :min حرفًا.',
        'confirmed' => 'تأكيد كلمة المرور غير متطابق.',
        'letters' => 'يجب أن تحتوي كلمة المرور على حرف واحد على الأقل.',
        'mixed_case' => 'يجب أن تحتوي كلمة المرور على أحرف كبيرة وصغيرة.',
        'numbers' => 'يجب أن تحتوي كلمة المرور على رقم واحد على الأقل.',
        'symbols' => 'يجب أن تحتوي كلمة المرور على رمز واحد على الأقل.',
        'uncompromised' => 'ظهرت كلمة المرور المقدمة في خرق للبيانات. يرجى اختيار كلمة مرور مختلفة.',
    ],
    'email' => [
        'required' => 'البريد الإلكتروني مطلوب.',
        'email' => 'يجب أن يكون البريد الإلكتروني عنوان بريد إلكتروني صالح.',
    ],
    'country' => [
        'required' => 'الدولة مطلوب',
    ] ,
    'phone' => [
        'required' => 'رقم الهاتف مطلوب.',
        'mobile_number' => 'رقم الهاتف يحتاج إلى بادئة'
    ],
    'verification_method' => [
        'required' => 'طريقة التحقق مطلوبة.',
        'in' => 'يجب أن تكون طريقة التحقق إما عبر البريد الإلكتروني أو الهاتف.',
    ],
];
