<?php

return [
    'image' => [
        'required' => 'حقل الصورة مطلوب.',
        'file' => 'يجب أن يكون الملف من نوع ملف.',
        'mimes' => 'يجب أن يكون الملف من الأنواع: jpeg, png, jpg, gif, svg.',
        'max' => 'لا يمكن أن يتجاوز حجم الصورة 2048 كيلوبايت.',
    ],
    'name_game' => [
        'required' => 'حقل اسم اللعبة مطلوب.',
        'max' => 'يجب ان يكون حجم الاسم اقل من 255 حرف '
     ],
    'challenge_id' => [
        'required' => 'رقم التحدي مطلوب.',
        'integer' => 'رقم التحدي يجب أن يكون عدد صحيح.',
        'exists' => 'رقم التحدي المحدد غير صالح.',
    ],

    'first_competitor_id' => [
        'required' => 'رقم المتسابق الأول مطلوب.',
        'integer' => 'رقم المتسابق الأول يجب أن يكون عدد صحيح.',
        'exists' => 'رقم المتسابق الأول المحدد غير صالح.',
    ],

    'second_competitor_id' => [
        'required' => 'رقم المتسابق الثاني مطلوب.',
        'integer' => 'رقم المتسابق الثاني يجب أن يكون عدد صحيح.',
        'exists' => 'رقم المتسابق الثاني المحدد غير صالح.',
    ],

    'winner_id' => [
        'required' => 'رقم الفائز مطلوب.',
        'integer' => 'رقم الفائز يجب أن يكون عدد صحيح.',
        'exists' => 'رقم الفائز المحدد غير صالح.',
    ],

    'score_FC' => [
        'required' => 'النتيجة للمتسابق الاول مطلوبة.',
        'integer' => 'النتيجة للمتسابق  الاول يجب أن تكون عدد صحيح.',
        'max' => 'النتيجة للمتسابق الاول  يجب ألا تتجاوز :max.',
    ],

    'score_SC' => [
        'required' => 'النتيجة للمتسابق الثاني  مطلوبة.',
        'integer' => 'النتيجة للمتسابق الثاني  يجب أن تكون عدد صحيح.',
        'max' => 'النتيجة للمتسابق الثاني  يجب ألا تتجاوز :max.',
    ],
    'category_id' => [
        'required' => 'حقل نوع اللعبة مطلوب ' ,
        'integer' => 'يجب ان يكون نوع اللعبة المرجع رقم' ,
        'not_in' =>  'نوع اللعبة المرفق غير صحيح ' ,
        'exists' =>  'نوع اللعبة غير موجود '
    ],
    'user1_id' => [
        'required' =>  'قيمة منشا اللعبة غير موجود ' ,
        'integer' =>   'مرجع حقل منشأ يجب ان يكون رقم ' ,
        'exists' =>  'القيمة المرجعة من حقل المنشأ غير موجود '
    ],
      'user2_id' => [
        'required' =>  'حقل المنافس مطلوب ' ,
        'integer' =>   'مرجع حقل منافس يجب ان يكون رقم ' ,
        'exists' =>  'القيمة المرجعة من حقل المنافس غير موجود '
         ],
    'competition_over_competitor_notification_title' => 'المسابقة على وشك الانتهاء !' ,
    'competition_over_competitor_notification_body' => 'صديقك انتهى من اللعبة بقية القليل من وقت ' ,
    'invitation_accept_competitor_notification_title'=> 'التحدي قد بدا!' ,
    'invitation_accept_competitor_notification_body' => 'وافق على انضمام  لتحدي هيا بنا !' ,
    'invitation_notification_title' => 'منافسة جديدة !' ,
    'invitation_notification_body' => 'احمد قام بدعوتك لمنافسة في تطبيق جاوبنا هي بنا ! ' ,
    'accept_friend_request_notification_title' => 'تم قبول طلب الصداقة!' ,
    'accept_friend_request_notification_body' => ' قبل طلب الصداقة الخاص بك. قل مرحبًا وابدأ لعبة معًا!' ,
    'friend_request_notification_title' => 'طلب الصداقة' ,
    'friend_request_notification_body' => 'أرسل لك طلب صداقة ' ,
    'sender_id.required' => 'حقل الاسم مطلوب.',
    'sender_id.exists' => ' رقم معرف غير موجود',
    'receiver_id.required' => 'حقل الاسم مطلوب.',
    'receiver_id.exists' => ' رقم معرف غير موجود',
    'id.exists' => 'الفئة المحددة ليست فئة أساسية صالحة.',
    'id.required' => 'حقل المعرف  مطلوب.',
    'id.integer' => 'يجب ان يكون المعرف رقما ',
    'ERROR_OCCURRED' => 'حدث خطأ ' ,
    'id_not_found' => 'حدث خطأ:عنصر  غير موجود  ' ,
    'friend_request_exists' =>'لقد قمت بارسال طلب الصداقة مسبقا!' ,
    'invalid_credentials' => 'كلمة المرور او الايميل غير صالحين ' ,
    'title.required' => 'حقل الاسم مطلوب.',
    'title.string' => 'يجب أن يكون الاسم نصًا.',
    'title.max' => 'لا يمكن أن يتجاوز طول الاسم 255 حرفًا.',

    'description.required' => 'حقل الاسم مطلوب.',
    'description.string' => 'يجب أن يكون الاسم نصًا.',

    'full_name.required' => 'حقل الاسم الكامل مطلوب.',
    'full_name.string' => 'يجب أن يكون الاسم الكامل نصًا.',
    'full_name.max' => 'لا يمكن أن يتجاوز طول الاسم الكامل 255 حرفًا.',

    'email.required' => 'حقل البريد الإلكتروني مطلوب.',
    'email.string' => 'يجب أن يكون البريد الإلكتروني نصًا.',
    'email.email' => 'يجب أن يكون البريد الإلكتروني عنوان بريد إلكتروني صالح.',
    'email.max' => 'لا يمكن أن يتجاوز طول البريد الإلكتروني 255 حرفًا.',
    'email.unique' => 'البريد الإلكتروني مستخدم بالفعل.',

    'phone.required' => 'حقل رقم الهاتف مطلوب.',
    'phone.string' => 'يجب أن يكون رقم الهاتف نصًا.',
    'phone.unique' => 'رقم الهاتف مستخدم بالفعل.',
    'phone.prefix' => 'يجب أن يحتوي رقم الجوال على مقدمة الدولة :prefix ويتكون من 9 إلى 14 رقماً.',
    'password' => [
        'required' => 'حقل كلمة المرور مطلوب.',
        'string' => 'يجب أن تكون كلمة المرور عبارة عن سلسلة.',
        'min' => 'يجب أن تكون كلمة المرور على الأقل :min حرفًا.',
        'confirmed' => 'تأكيد كلمة المرور غير متطابق.',
        'letters' => 'يجب أن تحتوي كلمة المرور على حرف واحد على الأقل.',
        'mixed_case' => 'يجب أن تحتوي كلمة المرور على أحرف كبيرة وصغيرة.',
        'numbers' => 'يجب أن تحتوي كلمة المرور على رقم واحد على الأقل.',
        'symbols' => 'يجب أن تحتوي كلمة المرور على رمز واحد على الأقل.',
        'uncompromised' => 'ظهرت كلمة المرور المقدمة في خرق للبيانات. يرجى اختيار كلمة مرور مختلفة.',
    ],
    'email' => [
        'required' => 'البريد الإلكتروني مطلوب.',
        'email' => 'يجب أن يكون البريد الإلكتروني عنوان بريد إلكتروني صالح.',
    ],
    'country' => [
        'required' => 'الدولة مطلوب',
    ] ,
    'phone' => [
        'required' => 'رقم الهاتف مطلوب.',
        'mobile_number' => 'رقم الهاتف يحتاج إلى بادئة'
    ],
    'verification_method' => [
        'required' => 'طريقة التحقق مطلوبة.',
        'in' => 'يجب أن تكون طريقة التحقق إما عبر البريد الإلكتروني أو الهاتف.',
    ],
];
